# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\JohnP\OneDrive\College\2015-2016 Senior Year\0 Fall Quarter\CE4920 011\Lab\project\CE4920Project1\USBFS_HID01.cydsn\USBFS_HID01.cyprj
# Date: Wed, 07 Oct 2015 06:36:32 GMT
#set_units -time ns
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 30.3030303030303 -waveform {0 15.1515151515152} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 30.3030303030303 -waveform {0 15.1515151515152} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]


# Component constraints for C:\Users\JohnP\OneDrive\College\2015-2016 Senior Year\0 Fall Quarter\CE4920 011\Lab\project\CE4920Project1\USBFS_HID01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\JohnP\OneDrive\College\2015-2016 Senior Year\0 Fall Quarter\CE4920 011\Lab\project\CE4920Project1\USBFS_HID01.cydsn\USBFS_HID01.cyprj
# Date: Wed, 07 Oct 2015 06:36:26 GMT
